snlkuharlocal/src/Documents/ЗаявкаНаСкидки/ЗаявкаНаСкидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаСкидки</name>
  <basedOn>Document.УстановкаСкидок</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействителенПо</name>
    <comment>Дата окончания действия скидок</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.УстановкаСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаСкидки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбмена</name>
    <comment>Статус обмена</comment>
    <type>
      <types>EnumRef.СтатусыОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаявки</name>
    <type>
      <types>EnumRef.ВидыЗаявокНаСкидки</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТовара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Брэнд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/СкидкиНоменклатуры/СкидкиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.УстановкаСкидок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СтатусыЗаявокНаСкидки/СтатусыЗаявокНаСкидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявокНаСкидки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыЗаявокНаСкидки/ВидыЗаявокНаСкидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗаявокНаСкидки</name>
  <enumValues>
    <name>УстановкаСкидок</name>
  </enumValues>
  <enumValues>
    <name>ПродлениеСкидок</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаявкаНаСкидки/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЭтотОбъект.Автор	= ПараметрыСеанса.Пользователь;
	ЭтотОбъект.Статус	= Перечисления.СтатусыЗаявокНаСкидки.ВРаботе;
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда Возврат; КонецЕсли;

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УстановкаСкидок") Тогда
		
		// Заполнение шапки
		МассивПолей = "
		|Комментарий,
		|ТипСкидок";		
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, МассивПолей);
		
		ЭтотОбъект.ДокОснование = ДанныеЗаполнения;
		ЭтотОбъект.ВидЗаявки	= Перечисления.ВидыЗаявокНаСкидки.ПродлениеСкидок;
		
		// заполнение ТЧ Скидки
		НаборЗаписей = РегистрыСведений.СкидкиНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(ДанныеЗаполнения);
		НаборЗаписей.Прочитать();
		
		ЭтотОбъект.Скидки.Загрузить(НаборЗаписей.Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.Автор	= ПараметрыСеанса.Пользователь;
	ЭтотОбъект.Статус	= Перечисления.СтатусыЗаявокНаСкидки.ВРаботе;
КонецПроцедуры
